bit-finance/Catalogs/бит_МоделиИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_МоделиИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПоставщикиИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифGigaChat</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРесурсаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОбработкиВложений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_МетодыОбработкиВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикРаспознаванияДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезопасноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиИспользоватьАутентификациюОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Enums/бит_МетодыОбработкиВложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_МетодыОбработкиВложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>APIМодели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрокаBase64</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисРаспознавания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ПоставщикиИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ПоставщикиИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OpenAI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Gemini</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Yandex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GigaChat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RuTronix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_МоделиИИ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
		ХранимыеДанные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка,
							"КлючAPI, ИдентификаторКаталога, ПарольПрокси");
		КлючAPI               = ?(ЗначениеЗаполнено(ХранимыеДанные.КлючAPI), УникальныйИдентификатор, "");
		ИдентификаторКаталога = ?(ЗначениеЗаполнено(ХранимыеДанные.ИдентификаторКаталога), УникальныйИдентификатор, "");
		ПарольПрокси          = ?(ЗначениеЗаполнено(ХранимыеДанные.ПарольПрокси), УникальныйИдентификатор, "");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	АвтоНаименование = Объект.Ссылка.Пустая() ИЛИ СтрНачинаетсяС(Объект.Наименование, Объект.Поставщик);
	
	Если НЕ Объект.Поставщик.Пустая() Тогда
		ЗаполнитьДанныеПоставщика();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
 
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если КлючИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, КлючAPI, "КлючAPI");
		УстановитьПривилегированныйРежим(Ложь);
		КлючAPI = ?(ЗначениеЗаполнено(КлючAPI), УникальныйИдентификатор, "");
		КлючИзменен = Ложь;
	КонецЕсли;
	
	Если ИдентификаторКаталогаИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ИдентификаторКаталога, "ИдентификаторКаталога");
		УстановитьПривилегированныйРежим(Ложь);
		ИдентификаторКаталога = ?(ЗначениеЗаполнено(ИдентификаторКаталога), УникальныйИдентификатор, "");
		ИдентификаторКаталогаИзменен = Ложь;
	КонецЕсли;
	
	Если ПарольПроксиИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ПарольПрокси, "ПарольПрокси");
		УстановитьПривилегированныйРежим(Ложь);
		ПарольПрокси = ?(ЗначениеЗаполнено(ПарольПрокси), УникальныйИдентификатор, "");
		ПарольПроксиИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	АвтоНаименование = ПустаяСтрока(Объект.Наименование);
	
КонецПроцедуры

&НаСервере
Процедура ПоставщикПриИзмененииНаСервере()
	
	ЗаполнитьПараметрыПоставщикаПоУмолчанию();
	ЗаполнитьДанныеПоставщика();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	СформироватьНаименование();
	ПоставщикПриИзмененииНаСервере();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидМоделиПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура БазовыйURLПриИзменении(Элемент)
	
	АдресСервера = СокрЛП(Объект.АдресСервера);
	Если ПустаяСтрока(АдресСервера) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНачинаетсяС(НРег(АдресСервера), "https://") Тогда
		Объект.ИспользоватьБезопасноеСоединение = Истина;
		АдресСервера = Сред(АдресСервера, 9);
	ИначеЕсли СтрНачинаетсяС(НРег(АдресСервера), "http://") Тогда
		Объект.ИспользоватьБезопасноеСоединение = Ложь;
		АдресСервера = Сред(АдресСервера, 8);
	КонецЕсли;
	
	ПозицияДвоеточия = СтрНайти(АдресСервера, ":");
	Если ПозицияДвоеточия > 0 Тогда
		ПортСтрокой  = Сред(АдресСервера, ПозицияДвоеточия + 1);
		АдресСервера = Лев(АдресСервера, ПозицияДвоеточия - 1);
		Попытка
			Объект.ПортСервера = Число(ПортСтрокой);
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось определить порт: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПортСтрокой);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
	Объект.АдресСервера = АдресСервера;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючAPIПриИзменении(Элемент)
	
	КлючИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКаталогаПриИзменении(Элемент)
	
	ИдентификаторКаталогаИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПроксиПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПроксиПриИзменении(Элемент)
	
	ПарольПроксиИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура МетодОбработкиВложенийПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНастройкаСервиса(Команда)
	
	ОповещениеОЗавершенииРедактирования = Новый ОписаниеОповещения("ПриЗавершенииРедактированияОбработчика", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбработчикРаспознаванияДокументов", Объект.ОбработчикРаспознаванияДокументов);
	ОткрытьФорму("Справочник.бит_МоделиИИ.Форма.ОбработчикСервисаРаспознавания", ПараметрыФормы, ЭтотОбъект,
		УникальныйИдентификатор,,, ОповещениеОЗавершенииРедактирования);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	Элементы.АдресРесурсаФайлов.Видимость =
		(Объект.МетодОбработкиВложений = ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.APIМодели"));
	Элементы.КомандаНастройкаСервиса.Видимость =
		(Объект.МетодОбработкиВложений = ПредопределенноеЗначение("Перечисление.бит_МетодыОбработкиВложений.СервисРаспознавания"));	
	Элементы.ИдентификаторКаталога.Видимость =
		(Объект.Поставщик = ПредопределенноеЗначение("Перечисление.бит_ПоставщикиИИ.Yandex"));
	Элементы.ТарифGigaChat.Видимость =
		(Объект.Поставщик = ПредопределенноеЗначение("Перечисление.бит_ПоставщикиИИ.GigaChat"));
		
	ИспользоватьПрокси = Объект.ИспользоватьПрокси;
	Элементы.ПроксиСервер.Видимость                       = ИспользоватьПрокси;
	Элементы.ПроксиПорт.Видимость                         = ИспользоватьПрокси;
	Элементы.ПроксиИспользоватьАутентификациюОС.Видимость = ИспользоватьПрокси;
	Элементы.ПользовательПрокси.Видимость                 = ИспользоватьПрокси;
	Элементы.ПарольПрокси.Видимость                       = ИспользоватьПрокси;
	
	Элементы.ИнформацияОПоставщике.Видимость              = НЕ ПустаяСтрока(Форма.ИнформацияОПоставщике);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоставщикаПоУмолчанию()
	
	ПараметрыПоставщика = Перечисления.бит_ПоставщикиИИ.ПараметрыПоставщикаПоУмолчанию(Объект.Поставщик);
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыПоставщика);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоставщика()
	
	ОписаниеПараметров = Перечисления.бит_ПоставщикиИИ.ОписаниеПараметровПоставщика(Объект.Поставщик);
	Элементы.ВидМодели.СписокВыбора.ЗагрузитьЗначения(ОписаниеПараметров.ВидыМоделей);
	ИнформацияОПоставщике = ОписаниеПараметров.ИнформацияОПоставщике;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	Если НЕ АвтоНаименование Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Поставщик.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = Объект.Поставщик;
	Если НЕ ПустаяСтрока(Объект.ВидМодели) Тогда
		Объект.Наименование = СтрШаблон("%1 (%2)", Объект.Наименование, СокрЛП(Объект.ВидМодели));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииРедактированияОбработчика(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОбработчикРаспознаванияДокументов = Результат;
	
КонецПроцедуры

#КонецОбласти
